; domain
(define (domain sokoban)
        (:requirements :strips)
        (:predicates (sokoban ?x)                                                                   ;sokoban is at location x
                                 (crate ?x)                                                                     ;crate is at location x
                                 (leftOf ?x ?y)                                                                 ;location x is to the left of locaiton y
                                 (below ?x ?y)                                                                  ;location x is below location y
                                 (at ?x ?y)                                                                     ;object x is at location y
                                 (clear ?x))                                                                        ;x is a location

        (:action moveLeft
                :parameters (?sokoban ?x ?y)
                :precondition (and (sokoban ?sokoban)
                                                   (at ?sokoban ?x)
                                                   (leftOf ?y ?x)                                           ;location y is to the left of location x
                                                   (clear ?y))                                              ;and y is empty/clear, so move left to y
                :effect (and (at ?sokoban ?y) (clear ?x)
                                (not (at ?sokoban ?x)) (not (clear ?y))))

        (:action moveRight
                :parameters (?sokoban ?x ?y)
                :precondition (and (sokoban ?sokoban)
                                                        (at ?sokoban ?x)
                                                        (leftOf ?x ?y)                                            ;location x is to the left of y
                                                        (clear ?y))                                               ;and y is clear, so move right to y
                :effect (and (at ?sokoban ?y) (clear ?x)
                                (not (at ?sokoban ?x)) (not (clear ?y))))

        (:action moveUp
                :parameters (?sokoban ?x ?y)
                :precondition (and (sokoban ?sokoban)
                                                  (at ?sokoban ?x)
                                                  (below ?x ?y)                                              ;location x is below location y
                                                  (clear ?y))                                                ;and y is clear, so move up to y
                :effect (and (at ?sokoban ?y) (clear ?x)
                                (not (at ?sokoban ?x)) (not (clear ?y))))

        (:action moveDown
                :parameters (?sokoban ?x ?y)
                :precondition (and (sokoban ?sokoban)
                                                  (at ?sokoban ?x)
                                                  (below ?y ?x)                                              ;location y is below location x
                                                  (clear ?y))                                                ;and y is clear, so move down to y
                :effect (and (at ?sokoban ?y) (clear ?x)
                                (not (at ?sokoban ?x)) (not (clear ?y))))

        (:action pushLeft
                :parameters (?sokoban ?x ?y ?z ?crate)
                :precondition (and (sokoban ?sokoban)
                                                        (crate ?crate)
                                                        (leftOf ?y ?x)                                          ;location y is left of x
                                                        (leftOf ?z ?y)                                            ;z (destination for block) is left of where the block currently is
                                                        (at ?sokoban ?x)                                           ;sokoban player is at x
                                                        (at ?crate ?y)                                             ;crate is at y                                                                                                    
                                                        (clear ?z))                                                ;and location z is clear, so push crate left to z
                :effect (and (at ?sokoban ?y) (at ?crate ?z) 
                                (clear ?x) 
                                (not (at ?sokoban ?x)) 
                                (not (at ?crate ?y)) 
                                (not (clear ?z)) 
                                (not (clear ?y))))
                           
        (:action pushRight
                :parameters (?sokoban ?x ?y ?z ?crate)
                :precondition (and (sokoban ?sokoban)
                                                        (crate ?crate)
                                                        (leftOf ?x ?y)                                                ;x is left of y
                                                        (leftOf ?y ?z)                                                ;y is left of z
                                                        (at ?sokoban ?x)                                        ;sokoban is at x
                                                        (at ?crate ?y)                                                ;crate is at y
                                                        (clear ?z))                                                        ;z is clear, so push crate right to z
                :effect (and (at ?sokoban ?y) (at ?crate ?z) 
                                (clear ?x)
                                (not (at ?sokoban ?x))
                                (not (at ?crate ?y))
                                (not (clear ?z))
                                (not (clear ?y))))

        (:action pushUp
                :parameters (?sokoban ?x ?y ?z ?crate)
                :precondition (and (sokoban ?sokoban)
                                                        (crate ?crate)
                                                        (below ?x ?y)                                                ;x is below y
                                                        (below ?y ?z)                                                ;y is below z
                                                        (at ?sokoban ?x)                                        ;sokoban is at x
                                                        (at ?crate ?y)                                                ;crate is at y
                                                        (clear ?z))                                                        ;z is clear, so push crate up to z
                :effect (and (at ?sokoban ?y) (at ?crate ?z)
                                (clear ?x)
                                (not (at ?sokoban ?x))
                                (not (at ?crate ?y))
                                (not (clear ?y))
                                (not (clear ?z))))


        (:action pushDown
                :parameters (?sokoban ?x ?y ?z ?crate)
                :precondition (and (sokoban ?sokoban)
                                                        (crate ?crate)
                                                        (below ?y ?x)                                                ;y is below x
                                                        (below ?z ?y)                                                ;z is below y
                                                        (at ?sokoban ?x)                                        ;sokoban is at x
                                                        (at ?crate ?y)                                                ;crate is at y
                                                        (clear ?z))                                                        ;z is clear, so push crate down to z
                :effect (and (at ?sokoban ?y) (at ?crate ?z)
                                (clear ?x)
                                (not (at ?sokoban ?x))
                                (not (at ?crate ?y))
                                (not (clear ?y))
                                (not (clear ?z))))
)

; problem
(define (problem sokoban)
        (:domain sokoban)
        (:objects sokoban crate1 crate2 l1 l10 l11 l12 l17 l18 l19 l22 l23 l24 l29 l30 l31 l32 l33 l36 l37 l38 l39 l40)
        (:init (sokoban sokoban)
                (crate crate1)
                (crate crate2)
                (leftOf l10 l11)
                (leftOf l11 l12)
                (leftOf l17 l18)
                (leftOf l18 l19)
                (leftOf l22 l23)
                (leftOf l23 l24)
                (leftOf l29 l30)
                (leftOf l30 l31)
                (leftOf l31 l32)
                (leftOf l32 l33)
                (leftOf l36 l37)
                (leftOf l37 l38)
                (leftOf l38 l39)
                (leftOf l39 l40)
                (below l17 l10)
                (below l18 l11)
                (below l19 l12)
                (below l24 l17)
                (below l29 l22)
                (below l30 l23)
                (below l31 l24)
                (below l36 l29)
                (below l37 l30)
                (below l38 l31)
                (below l39 l32)
                (below l40 l33)
                (at sokoban l19)
                (at crate1 l17)
                (at crate2 l18)
                (clear l1)
                (clear l10)
                (clear l11)
                (clear l12)
                (clear l22)
                (clear l23)
                (clear l24)
                (clear l29)
                (clear l30)
                (clear l31)
                (clear l32)
                (clear l33)
                (clear l36)
                (clear l37)
                (clear l38)
                (clear l39)
                (clear l40)
        )
        (:goal (and
                (or (at crate1 l37) (at crate2 l37) )
                (or (at crate1 l39) (at crate2 l39) )
        ))
)

; plan
1. (moveup sokoban l19 l12)
   deleted: (at sokoban l19) (clear l12)
   added: (at sokoban l12) (clear l19)
   goals met: 0 of 2
2. (moveleft sokoban l12 l11)
   deleted: (at sokoban l12) (clear l11)
   added: (at sokoban l11) (clear l12)
   goals met: 0 of 2
3. (moveleft sokoban l11 l10)
   deleted: (at sokoban l11) (clear l10)
   added: (at sokoban l10) (clear l11)
   goals met: 0 of 2
4. (pushdown sokoban l10 l17 l24 crate1)
   deleted: (at sokoban l10) (at crate1 l17) (clear l24)
   added: (at sokoban l17) (at crate1 l24) (clear l10)
   goals met: 0 of 2
5. (pushdown sokoban l17 l24 l31 crate1)
   deleted: (at sokoban l17) (at crate1 l24) (clear l31)
   added: (at sokoban l24) (at crate1 l31) (clear l17)
   goals met: 0 of 2
6. (moveleft sokoban l24 l23)
   deleted: (at sokoban l24) (clear l23)
   added: (at sokoban l23) (clear l24)
   goals met: 0 of 2
7. (movedown sokoban l23 l30)
   deleted: (at sokoban l23) (clear l30)
   added: (at sokoban l30) (clear l23)
   goals met: 0 of 2
8. (movedown sokoban l30 l37)
   deleted: (at sokoban l30) (clear l37)
   added: (at sokoban l37) (clear l30)
   goals met: 0 of 2
9. (moveright sokoban l37 l38)
   deleted: (at sokoban l37) (clear l38)
   added: (at sokoban l38) (clear l37)
   goals met: 0 of 2
10. (moveright sokoban l38 l39)
   deleted: (at sokoban l38) (clear l39)
   added: (at sokoban l39) (clear l38)
   goals met: 0 of 2
11. (moveup sokoban l39 l32)
   deleted: (at sokoban l39) (clear l32)
   added: (at sokoban l32) (clear l39)
   goals met: 0 of 2
12. (pushleft sokoban l32 l31 l30 crate1)
   deleted: (at sokoban l32) (at crate1 l31) (clear l30)
   added: (at sokoban l31) (at crate1 l30) (clear l32)
   goals met: 0 of 2
13. (moveup sokoban l31 l24)
   deleted: (at sokoban l31) (clear l24)
   added: (at sokoban l24) (clear l31)
   goals met: 0 of 2
14. (moveup sokoban l24 l17)
   deleted: (at sokoban l24) (clear l17)
   added: (at sokoban l17) (clear l24)
   goals met: 0 of 2
15. (moveup sokoban l17 l10)
   deleted: (at sokoban l17) (clear l10)
   added: (at sokoban l10) (clear l17)
   goals met: 0 of 2
16. (moveright sokoban l10 l11)
   deleted: (at sokoban l10) (clear l11)
   added: (at sokoban l11) (clear l10)
   goals met: 0 of 2
17. (moveright sokoban l11 l12)
   deleted: (at sokoban l11) (clear l12)
   added: (at sokoban l12) (clear l11)
   goals met: 0 of 2
18. (movedown sokoban l12 l19)
   deleted: (at sokoban l12) (clear l19)
   added: (at sokoban l19) (clear l12)
   goals met: 0 of 2
19. (pushleft sokoban l19 l18 l17 crate2)
   deleted: (at sokoban l19) (at crate2 l18) (clear l17)
   added: (at sokoban l18) (at crate2 l17) (clear l19)
   goals met: 0 of 2
20. (moveup sokoban l18 l11)
   deleted: (at sokoban l18) (clear l11)
   added: (at sokoban l11) (clear l18)
   goals met: 0 of 2
21. (moveleft sokoban l11 l10)
   deleted: (at sokoban l11) (clear l10)
   added: (at sokoban l10) (clear l11)
   goals met: 0 of 2
22. (pushdown sokoban l10 l17 l24 crate2)
   deleted: (at sokoban l10) (at crate2 l17) (clear l24)
   added: (at sokoban l17) (at crate2 l24) (clear l10)
   goals met: 0 of 2
23. (pushdown sokoban l17 l24 l31 crate2)
   deleted: (at sokoban l17) (at crate2 l24) (clear l31)
   added: (at sokoban l24) (at crate2 l31) (clear l17)
   goals met: 0 of 2
24. (pushdown sokoban l24 l31 l38 crate2)
   deleted: (at sokoban l24) (at crate2 l31) (clear l38)
   added: (at sokoban l31) (at crate2 l38) (clear l24)
   goals met: 0 of 2
25. (moveup sokoban l31 l24)
   deleted: (at sokoban l31) (clear l24)
   added: (at sokoban l24) (clear l31)
   goals met: 0 of 2
26. (moveleft sokoban l24 l23)
   deleted: (at sokoban l24) (clear l23)
   added: (at sokoban l23) (clear l24)
   goals met: 0 of 2
27. (moveleft sokoban l23 l22)
   deleted: (at sokoban l23) (clear l22)
   added: (at sokoban l22) (clear l23)
   goals met: 0 of 2
28. (movedown sokoban l22 l29)
   deleted: (at sokoban l22) (clear l29)
   added: (at sokoban l29) (clear l22)
   goals met: 0 of 2
29. (movedown sokoban l29 l36)
   deleted: (at sokoban l29) (clear l36)
   added: (at sokoban l36) (clear l29)
   goals met: 0 of 2
30. (moveright sokoban l36 l37)
   deleted: (at sokoban l36) (clear l37)
   added: (at sokoban l37) (clear l36)
   goals met: 0 of 2
31. (pushright sokoban l37 l38 l39 crate2)
   deleted: (at sokoban l37) (at crate2 l38) (clear l39)
   added: (at sokoban l38) (at crate2 l39) (clear l37)
   goals met: 1 of 2
32. (moveup sokoban l38 l31)
   deleted: (at sokoban l38) (clear l31)
   added: (at sokoban l31) (clear l38)
   goals met: 1 of 2
33. (moveup sokoban l31 l24)
   deleted: (at sokoban l31) (clear l24)
   added: (at sokoban l24) (clear l31)
   goals met: 1 of 2
34. (moveleft sokoban l24 l23)
   deleted: (at sokoban l24) (clear l23)
   added: (at sokoban l23) (clear l24)
   goals met: 1 of 2
35. (pushdown sokoban l23 l30 l37 crate1)
   deleted: (at sokoban l23) (at crate1 l30) (clear l37)
   added: (at sokoban l30) (at crate1 l37) (clear l23)
   goals met: 2 of 2
